[Killed] ConditionalExpression
src/api/sectionsApi.ts:48:9
 
 function isErrorBody(body: unknown): body is ErrorBody {
     return (
-        typeof body === "object" &&
-        body !== null &&
-        ("error" in body || "message" in body)
+        false
     );
 }
killedBy: createSection throws 409 error message from backend
statusReason: expected [Function] to throw error including 'Section already exists' but got 'Invalid request.'

[Survived] ConditionalExpression
src/api/sectionsApi.ts:48:9
 
 function isErrorBody(body: unknown): body is ErrorBody {
     return (
-        typeof body === "object" &&
-        body !== null &&
-        ("error" in body || "message" in body)
+        true
     );
 }

[Killed] LogicalOperator
src/api/sectionsApi.ts:50:10
     return (
         typeof body === "object" &&
         body !== null &&
-        ("error" in body || "message" in body)
+        ("error" in body && "message" in body)
     );
 }
killedBy: createSection throws 409 error message from backend
statusReason: expected [Function] to throw error including 'Section already exists' but got 'Invalid request.'

[Survived] ConditionalExpression
src/api/sectionsApi.ts:50:10
     return (
         typeof body === "object" &&
         body !== null &&
-        ("error" in body || "message" in body)
+        (true)
     );
 }

[Killed] LogicalOperator
src/api/sectionsApi.ts:55:32
 }
 
 function getBackendMessage(body: unknown): string | undefined {
-    return isErrorBody(body) ? body.error ?? body.message : undefined;
+    return isErrorBody(body) ? body.error && body.message : undefined;
 }
 
killedBy: createSection throws 409 error message from backend
statusReason: expected [Function] to throw error including 'Section already exists' but got 'Invalid request.'

[Survived] StringLiteral
src/api/sectionsApi.ts:69:17
     // Timestamp added in the backend (time of storage).
 }) {
     const response = await fetch("/api/v1/sections/create", {
-        method: "POST",
+        method: "",
         credentials: "include",
         headers: { "Content-Type": "application/json" },

[Survived] ArrowFunction
src/api/sectionsApi.ts:75:47
         body: JSON.stringify(data),
     });
 
-    const body = (await response.json().catch(() => ({})));
+    const body = (await response.json().catch(() => undefined));
 
     if (!response.ok) {

[Killed] ConditionalExpression
src/api/sectionsApi.ts:81:13
         const msg = getBackendMessage(body);
 
         switch (response.status) {
-            case 401:
-                throw new Error("Only logged-in users may create sections.");
+            case 401:
             case 409:
             case 422:
killedBy: createSection throws 401 error message
statusReason: expected [Function] to throw error including 'Only logged-in users may create secti…' but got 'Unauthorized'

[Survived] ConditionalExpression
src/api/sectionsApi.ts:84:13
             case 401:
                 throw new Error("Only logged-in users may create sections.");
             case 409:
-            case 422:
-                throw new Error(msg ?? "Invalid request.");
+            case 422:
             default:
                 throw new Error(msg ?? "Something went wrong. Please try again.");

[Killed] LogicalOperator
src/api/sectionsApi.ts:85:33
                 throw new Error("Only logged-in users may create sections.");
             case 409:
             case 422:
-                throw new Error(msg ?? "Invalid request.");
+                throw new Error(msg && "Invalid request.");
             default:
                 throw new Error(msg ?? "Something went wrong. Please try again.");
killedBy: createSection throws 409 error message from backend
statusReason: expected [Function] to throw error including 'Section already exists' but got 'Invalid request.'

[NoCoverage] StringLiteral
src/api/sectionsApi.ts:85:40
                 throw new Error("Only logged-in users may create sections.");
             case 409:
             case 422:
-                throw new Error(msg ?? "Invalid request.");
+                throw new Error(msg ?? "");
             default:
                 throw new Error(msg ?? "Something went wrong. Please try again.");

[Killed] ConditionalExpression
src/api/sectionsApi.ts:86:13
             case 409:
             case 422:
                 throw new Error(msg ?? "Invalid request.");
-            default:
-                throw new Error(msg ?? "Something went wrong. Please try again.");
+            default:
         }
     }
killedBy: createSection throws generic error for unexpected status (500)
statusReason: promise resolved "{ error: 'Internal server error' }" instead of rejecting

[Killed] LogicalOperator
src/api/sectionsApi.ts:87:33
             case 422:
                 throw new Error(msg ?? "Invalid request.");
             default:
-                throw new Error(msg ?? "Something went wrong. Please try again.");
+                throw new Error(msg && "Something went wrong. Please try again.");
         }
     }
killedBy: createSection throws generic error for unexpected status (500)
statusReason: expected [Function] to throw error including 'Internal server error' but got 'Something went wrong. Please try agai…'

[NoCoverage] StringLiteral
src/api/sectionsApi.ts:87:40
             case 422:
                 throw new Error(msg ?? "Invalid request.");
             default:
-                throw new Error(msg ?? "Something went wrong. Please try again.");
+                throw new Error(msg ?? "");
         }
     }

[Survived] StringLiteral
src/api/sectionsApi.ts:98:15
 // Public endpoint, so no credentials needed.
 export async function getCoursePage(courseCode: string) {
     const [sectionsRes, definitionsRes] = await Promise.all([
-        fetch(`/api/v1/sections/${encodeURIComponent(courseCode)}`),
+        fetch(``),
         fetch(`/api/v1/definitions/${encodeURIComponent(courseCode)}`)
     ]);

[Survived] StringLiteral
src/api/sectionsApi.ts:99:15
 export async function getCoursePage(courseCode: string) {
     const [sectionsRes, definitionsRes] = await Promise.all([
         fetch(`/api/v1/sections/${encodeURIComponent(courseCode)}`),
-        fetch(`/api/v1/definitions/${encodeURIComponent(courseCode)}`)
+        fetch(``)
     ]);
 

[Timeout] ArrowFunction
src/api/sectionsApi.ts:102:66
         fetch(`/api/v1/definitions/${encodeURIComponent(courseCode)}`)
     ]);
 
-    const sectionsBody: unknown = await sectionsRes.json().catch(() => ([]));
+    const sectionsBody: unknown = await sectionsRes.json().catch(() => undefined);
     const definitionsBody: unknown = await definitionsRes.json().catch(() => ([]));
 

[Survived] ArrowFunction
src/api/sectionsApi.ts:103:72
     ]);
 
     const sectionsBody: unknown = await sectionsRes.json().catch(() => ([]));
-    const definitionsBody: unknown = await definitionsRes.json().catch(() => ([]));
+    const definitionsBody: unknown = await definitionsRes.json().catch(() => undefined);
 
     if (!sectionsRes.ok) {

[NoCoverage] ArrayDeclaration
src/api/sectionsApi.ts:103:79
     ]);
 
     const sectionsBody: unknown = await sectionsRes.json().catch(() => ([]));
-    const definitionsBody: unknown = await definitionsRes.json().catch(() => ([]));
+    const definitionsBody: unknown = await definitionsRes.json().catch(() => (["Stryker was here"]));
 
     if (!sectionsRes.ok) {

[Killed] ConditionalExpression
src/api/sectionsApi.ts:105:9
     const sectionsBody: unknown = await sectionsRes.json().catch(() => ([]));
     const definitionsBody: unknown = await definitionsRes.json().catch(() => ([]));
 
-    if (!sectionsRes.ok) {
+    if (false) {
         const msg = getBackendMessage(sectionsBody);
         throw new Error(msg ?? "Failed to load sections.");
killedBy: getCoursePage throws error when sections response is not ok
statusReason: promise resolved "{ courseCode: 'COMP 1010', …(2) }" instead of rejecting

[Killed] BlockStatement
src/api/sectionsApi.ts:105:26
     const sectionsBody: unknown = await sectionsRes.json().catch(() => ([]));
     const definitionsBody: unknown = await definitionsRes.json().catch(() => ([]));
 
-    if (!sectionsRes.ok) {
-        const msg = getBackendMessage(sectionsBody);
-        throw new Error(msg ?? "Failed to load sections.");
-    }
+    if (!sectionsRes.ok) {}
 
     if (!definitionsRes.ok) {
killedBy: getCoursePage throws error when sections response is not ok
statusReason: promise resolved "{ courseCode: 'COMP 1010', …(2) }" instead of rejecting

[Survived] LogicalOperator
src/api/sectionsApi.ts:107:25
 
     if (!sectionsRes.ok) {
         const msg = getBackendMessage(sectionsBody);
-        throw new Error(msg ?? "Failed to load sections.");
+        throw new Error(msg && "Failed to load sections.");
     }
 

[Killed] ConditionalExpression
src/api/sectionsApi.ts:110:9
         throw new Error(msg ?? "Failed to load sections.");
     }
 
-    if (!definitionsRes.ok) {
+    if (false) {
         const msg = getBackendMessage(definitionsBody);
         throw new Error(msg ?? "Failed to load definitions.");
killedBy: getCoursePage throws error when definitions response is not ok
statusReason: promise resolved "{ courseCode: 'COMP 1010', …(2) }" instead of rejecting

[Killed] BooleanLiteral
src/api/sectionsApi.ts:110:9
         throw new Error(msg ?? "Failed to load sections.");
     }
 
-    if (!definitionsRes.ok) {
+    if (definitionsRes.ok) {
         const msg = getBackendMessage(definitionsBody);
         throw new Error(msg ?? "Failed to load definitions.");
killedBy: getCoursePage returns sections and definitions when both responses are ok
statusReason: Failed to load definitions.

[Survived] LogicalOperator
src/api/sectionsApi.ts:112:25
 
     if (!definitionsRes.ok) {
         const msg = getBackendMessage(definitionsBody);
-        throw new Error(msg ?? "Failed to load definitions.");
+        throw new Error(msg && "Failed to load definitions.");
     }
     

[Killed] BlockStatement
src/api/sectionsApi.ts:141:23
 
     const body = (await response.json().catch(() => ({})));
 
-    if (!response.ok) {
-        const msg = getBackendMessage(body);
-
-        switch (response.status) {
-            case 401:
-                throw new Error("Only logged-in users may update sections.");
-            case 404:
-                throw new Error(msg ?? "Section not found.");
-            case 409:
-            case 422:
-                throw new Error(msg ?? "Invalid request.");
-            default:
-                throw new Error(msg ?? "Something went wrong. Please try again.");
-        }
-    }
+    if (!response.ok) {}
 
     // This could be the updated section or an update result object.
killedBy: updateSection throws 401 error message
statusReason: promise resolved "{ error: 'Unauthorized' }" instead of rejecting

[Killed] ConditionalExpression
src/api/sectionsApi.ts:145:13
         const msg = getBackendMessage(body);
 
         switch (response.status) {
-            case 401:
-                throw new Error("Only logged-in users may update sections.");
+            case 401:
             case 404:
                 throw new Error(msg ?? "Section not found.");
killedBy: updateSection throws 401 error message
statusReason: expected [Function] to throw error including 'Only logged-in users may update secti…' but got 'Unauthorized'

[Survived] ConditionalExpression
src/api/sectionsApi.ts:147:13
         switch (response.status) {
             case 401:
                 throw new Error("Only logged-in users may update sections.");
-            case 404:
-                throw new Error(msg ?? "Section not found.");
+            case 404:
             case 409:
             case 422:

[Survived] LogicalOperator
src/api/sectionsApi.ts:148:33
             case 401:
                 throw new Error("Only logged-in users may update sections.");
             case 404:
-                throw new Error(msg ?? "Section not found.");
+                throw new Error(msg && "Section not found.");
             case 409:
             case 422:

[Survived] StringLiteral
src/api/sectionsApi.ts:166:36
     const response = await fetch(`/api/v1/sections/delete/${data.sectionId}`, {
         method: "DELETE",
         credentials: "include",
-        headers: { "Content-Type": "application/json" },
+        headers: { "Content-Type": "" },
         body: JSON.stringify(data),
     });

[Killed] ConditionalExpression
src/api/sectionsApi.ts:176:13
         const msg = getBackendMessage(body);
 
         switch (response.status) {
-            case 401:
-                throw new Error("Only logged-in users may delete sections.");
+            case 401:
             case 404:
                 throw new Error(msg ?? "Section not found.");
killedBy: deleteSection throws 401 error message
statusReason: expected [Function] to throw error including 'Only logged-in users may delete secti…' but got 'Unauthorized'

[Survived] ConditionalExpression
src/api/sectionsApi.ts:178:13
         switch (response.status) {
             case 401:
                 throw new Error("Only logged-in users may delete sections.");
-            case 404:
-                throw new Error(msg ?? "Section not found.");
+            case 404:
             case 409:
             case 422:

[Survived] StringLiteral
src/api/sectionsApi.ts:200:32
   definition: string;
   example: string;
 }) {
-  const response = await fetch("/api/v1/definitions/create", {
+  const response = await fetch("", {
     method: "POST",
     credentials: "include",

[Survived] ObjectLiteral
src/api/sectionsApi.ts:203:14
   const response = await fetch("/api/v1/definitions/create", {
     method: "POST",
     credentials: "include",
-    headers: { "Content-Type": "application/json" },
+    headers: {},
     body: JSON.stringify(data),
   });

[Killed] BlockStatement
src/api/sectionsApi.ts:209:21
 
   const body = (await response.json().catch(() => ({})));
 
-  if (!response.ok) {
-    const msg = getBackendMessage(body);
-
-    switch (response.status) {
-      case 401:
-        throw new Error("Only logged-in users may create definitions.");
-      case 409:
-      case 422:
-        throw new Error(msg ?? "Invalid request.");
-      default:
-        throw new Error(msg ?? "Something went wrong. Please try again.");
-    }
-  }
+  if (!response.ok) {}
 
   return body as Definition;
killedBy: createDefinition throws 401 error message
statusReason: promise resolved "{ error: 'Unauthorized' }" instead of rejecting

[Killed] ConditionalExpression
src/api/sectionsApi.ts:213:7
     const msg = getBackendMessage(body);
 
     switch (response.status) {
-      case 401:
-        throw new Error("Only logged-in users may create definitions.");
+      case 401:
       case 409:
       case 422:
killedBy: createDefinition throws 401 error message
statusReason: expected [Function] to throw error including 'Only logged-in users may create defin…' but got 'Unauthorized'

[Killed] StringLiteral
src/api/sectionsApi.ts:214:25
 
     switch (response.status) {
       case 401:
-        throw new Error("Only logged-in users may create definitions.");
+        throw new Error("");
       case 409:
       case 422:
killedBy: createDefinition throws 401 error message
statusReason: expected [Function] to throw error including 'Only logged-in users may create defin…' but got ''

[Killed] BlockStatement
src/api/sectionsApi.ts:241:21
 
   const body = (await response.json().catch(() => ({})));
 
-  if (!response.ok) {
-    const msg = getBackendMessage(body);
-
-    switch (response.status) {
-      case 401:
-        throw new Error("Only logged-in users may update definitions.");
-      case 404:
-        throw new Error(msg ?? "Definition not found.");
-      case 409:
-      case 422:
-        throw new Error(msg ?? "Invalid request.");
-      default:
-        throw new Error(msg ?? "Something went wrong. Please try again.");
-    }
-  }
+  if (!response.ok) {}
 
   return body as Definition;
killedBy: updateDefinition throws 401 error message
statusReason: promise resolved "{ error: 'Unauthorized' }" instead of rejecting

[Killed] ConditionalExpression
src/api/sectionsApi.ts:245:7
     const msg = getBackendMessage(body);
 
     switch (response.status) {
-      case 401:
-        throw new Error("Only logged-in users may update definitions.");
+      case 401:
       case 404:
         throw new Error(msg ?? "Definition not found.");
killedBy: updateDefinition throws 401 error message
statusReason: expected [Function] to throw error including 'Only logged-in users may update defin…' but got 'Unauthorized'

[Survived] ConditionalExpression
src/api/sectionsApi.ts:247:7
     switch (response.status) {
       case 401:
         throw new Error("Only logged-in users may update definitions.");
-      case 404:
-        throw new Error(msg ?? "Definition not found.");
+      case 404:
       case 409:
       case 422:

[Survived] LogicalOperator
src/api/sectionsApi.ts:248:25
       case 401:
         throw new Error("Only logged-in users may update definitions.");
       case 404:
-        throw new Error(msg ?? "Definition not found.");
+        throw new Error(msg && "Definition not found.");
       case 409:
       case 422:

[Killed] ConditionalExpression
src/api/sectionsApi.ts:274:7
     const msg = getBackendMessage(body);
 
     switch (response.status) {
-      case 401:
-        throw new Error("Only logged-in users may delete definitions.");
+      case 401:
       case 404:
         throw new Error(msg ?? "Definition not found.");
killedBy: deleteDefinition throws 401 error message
statusReason: expected [Function] to throw error including 'Only logged-in users may delete defin…' but got 'Unauthorized'

[Survived] ConditionalExpression
src/api/sectionsApi.ts:276:7
     switch (response.status) {
       case 401:
         throw new Error("Only logged-in users may delete definitions.");
-      case 404:
-        throw new Error(msg ?? "Definition not found.");
+      case 404:
       case 409:
       case 422:
