[Killed] MethodExpression
src/utils/courseHelpers.ts:5:15
 // abiz-0440 --> ABIZ 0440
 export function getCourseCode(courseId: string): string {
     const [subject, number] = courseId.split("-");
-    return `${subject.toUpperCase()} ${number}`;
+    return `${subject.toLowerCase()} ${number}`;
 }
killedBy: getCourseCode converts a standard slug to uppercase course code
statusReason: expected 'comp 1010' to be 'COMP 1010' // Object.is equality
