[Survived] StringLiteral
src/api/userApi.ts:11:17
 
     // build the request
     const response = await fetch("/api/v1/user/create", {
-        method: "POST",
+        method: "",
         credentials: "include",
         headers: { "Content-Type": "application/json" },

[Killed] BlockStatement
src/api/userApi.ts:21:23
     const body = await response.json();
 
     // robustly throw errors
-    if (!response.ok) {
-        switch (response.status) {
-            case 409:
-            case 403:
-            case 422:
-                throw new Error(body.error); // known errors
-            default:
-                throw new Error("Something went wrong. Please try again.");
-        }
-    }
+    if (!response.ok) {}
 
     return body;
killedBy: createUser throws 409 conflict error message
statusReason: promise resolved "{ error: 'User already exists' }" instead of rejecting

[Killed] BooleanLiteral
src/api/userApi.ts:21:9
     const body = await response.json();
 
     // robustly throw errors
-    if (!response.ok) {
+    if (response.ok) {
         switch (response.status) {
             case 409:
killedBy: createUser returns body when response is ok
statusReason: Something went wrong. Please try again.

[Killed] ConditionalExpression
src/api/userApi.ts:25:13
         switch (response.status) {
             case 409:
             case 403:
-            case 422:
-                throw new Error(body.error); // known errors
+            case 422: // known errors // known errors
             default:
                 throw new Error("Something went wrong. Please try again.");
killedBy: createUser throws 409 conflict error message
statusReason: expected [Function] to throw error including 'User already exists' but got 'Something went wrong. Please try agai…'

[Killed] ConditionalExpression
src/api/userApi.ts:27:13
             case 403:
             case 422:
                 throw new Error(body.error); // known errors
-            default:
-                throw new Error("Something went wrong. Please try again.");
+            // known errors
+default:
         }
     }
killedBy: createUser throws generic error for unexpected status (404)
statusReason: promise resolved "{ error: 'Not Found' }" instead of rejecting

[Killed] BlockStatement
src/api/userApi.ts:35:59
     return body;
 }
 
-export async function requestVerificationCode(id: string) {
-    const response = await fetch(`/api/v1/user/${id}/request-verification-code`, {
-        method: "POST",
-        credentials: "include",
-        headers: { "Content-Type": "application/json" },
-    });
-
-    const body = await response.json();
-
-    // robust throw errors
-    if (!response.ok) {
-        switch (response.status) {
-            case 401:
-            case 403:
-            case 404:
-            case 409:
-                throw new Error(body.error);
-            default:
-                throw new Error("Something went wrong. Please try again.");
-        }
-    }
-}
+export async function requestVerificationCode(id: string) {}
 
 export async function verifyEmail(data: {email: string, code: string}) {
killedBy: requestVerificationCode throws 401 error message from backend
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/api/userApi.ts:36:34
 }
 
 export async function requestVerificationCode(id: string) {
-    const response = await fetch(`/api/v1/user/${id}/request-verification-code`, {
+    const response = await fetch(``, {
         method: "POST",
         credentials: "include",

[Killed] BlockStatement
src/api/userApi.ts:45:23
     const body = await response.json();
 
     // robust throw errors
-    if (!response.ok) {
-        switch (response.status) {
-            case 401:
-            case 403:
-            case 404:
-            case 409:
-                throw new Error(body.error);
-            default:
-                throw new Error("Something went wrong. Please try again.");
-        }
-    }
+    if (!response.ok) {}
 }
 
killedBy: requestVerificationCode throws 401 error message from backend
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/api/userApi.ts:45:9
     const body = await response.json();
 
     // robust throw errors
-    if (!response.ok) {
+    if (response.ok) {
         switch (response.status) {
             case 401:
killedBy: requestVerificationCode resolves without throwing when response is ok
statusReason: promise rejected "Error: Something went wrong. Please try a…" instead of resolving

[Killed] ConditionalExpression
src/api/userApi.ts:50:13
             case 401:
             case 403:
             case 404:
-            case 409:
-                throw new Error(body.error);
+            case 409:
             default:
                 throw new Error("Something went wrong. Please try again.");
killedBy: requestVerificationCode throws 401 error message from backend
statusReason: expected [Function] to throw error including 'Unauthorized' but got 'Something went wrong. Please try agai…'

[Killed] ConditionalExpression
src/api/userApi.ts:52:13
             case 404:
             case 409:
                 throw new Error(body.error);
-            default:
-                throw new Error("Something went wrong. Please try again.");
+            default:
         }
     }
killedBy: requestVerificationCode throws generic error for unexpected status (500)
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/api/userApi.ts:53:33
             case 409:
                 throw new Error(body.error);
             default:
-                throw new Error("Something went wrong. Please try again.");
+                throw new Error("");
         }
     }
killedBy: requestVerificationCode throws generic error for unexpected status (500)
statusReason: expected [Function] to throw error including 'Something went wrong. Please try agai…' but got ''

[Killed] BlockStatement
src/api/userApi.ts:58:72
     }
 }
 
-export async function verifyEmail(data: {email: string, code: string}) {
-    const response = await fetch(`/api/v1/user/verify-email`, {
-        method: "PUT",
-        credentials: "include",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify(data),
-    });
-
-    const body = await response.json();
-
-    // robust throw errors
-    if (!response.ok) {
-        switch (response.status) {
-            case 400:
-            case 404:
-            case 409:
-            case 422:
-                throw new Error(body.error);
-            default:
-                throw new Error("Something went wrong. Please try again.");
-        }
-    }
-}
+export async function verifyEmail(data: {email: string, code: string}) {}
 
 // Take in credentials of the user and send it to the endpoint.
killedBy: verifyEmail throws 400 error message from backend
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/api/userApi.ts:59:34
 }
 
 export async function verifyEmail(data: {email: string, code: string}) {
-    const response = await fetch(`/api/v1/user/verify-email`, {
+    const response = await fetch(``, {
         method: "PUT",
         credentials: "include",

[Survived] StringLiteral
src/api/userApi.ts:60:17
 
 export async function verifyEmail(data: {email: string, code: string}) {
     const response = await fetch(`/api/v1/user/verify-email`, {
-        method: "PUT",
+        method: "",
         credentials: "include",
         headers: { "Content-Type": "application/json" },

[Killed] ConditionalExpression
src/api/userApi.ts:69:9
     const body = await response.json();
 
     // robust throw errors
-    if (!response.ok) {
+    if (true) {
         switch (response.status) {
             case 400:
killedBy: verifyEmail resolves without throwing when response is ok
statusReason: promise rejected "Error: Something went wrong. Please try a…" instead of resolving

[Killed] BlockStatement
src/api/userApi.ts:69:23
     const body = await response.json();
 
     // robust throw errors
-    if (!response.ok) {
-        switch (response.status) {
-            case 400:
-            case 404:
-            case 409:
-            case 422:
-                throw new Error(body.error);
-            default:
-                throw new Error("Something went wrong. Please try again.");
-        }
-    }
+    if (!response.ok) {}
 }
 
killedBy: verifyEmail throws 400 error message from backend
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/api/userApi.ts:74:13
             case 400:
             case 404:
             case 409:
-            case 422:
-                throw new Error(body.error);
+            case 422:
             default:
                 throw new Error("Something went wrong. Please try again.");
killedBy: verifyEmail throws 400 error message from backend
statusReason: expected [Function] to throw error including 'Invalid verification code' but got 'Something went wrong. Please try agai…'

[Survived] StringLiteral
src/api/userApi.ts:90:34
 }) {
 
     // build the request
-    const response = await fetch("/api/v1/user/login", {
+    const response = await fetch("", {
         method: "POST",
         credentials: "include",

[Killed] ConditionalExpression
src/api/userApi.ts:100:9
     const body = await response.json();
 
     // robustly throw errors
-    if (!response.ok) {
+    if (true) {
         if (response.status === 403) {
             throw new Error(body.error);
killedBy: loginUser returns body when response is ok
statusReason: Something went wrong. Please try again.

[Killed] ConditionalExpression
src/api/userApi.ts:100:9
     const body = await response.json();
 
     // robustly throw errors
-    if (!response.ok) {
+    if (false) {
         if (response.status === 403) {
             throw new Error(body.error);
killedBy: loginUser throws 403 error message from backend
statusReason: promise resolved "{ error: 'Invalid email or password' }" instead of rejecting

[Killed] ConditionalExpression
src/api/userApi.ts:101:13
 
     // robustly throw errors
     if (!response.ok) {
-        if (response.status === 403) {
+        if (false) {
             throw new Error(body.error);
         }
killedBy: loginUser throws 403 error message from backend
statusReason: expected [Function] to throw error including 'Invalid email or password' but got 'Something went wrong. Please try agai…'

[Killed] BlockStatement
src/api/userApi.ts:101:38
 
     // robustly throw errors
     if (!response.ok) {
-        if (response.status === 403) {
-            throw new Error(body.error);
-        }
+        if (response.status === 403) {}
         throw new Error("Something went wrong. Please try again.");
     }
killedBy: loginUser throws 403 error message from backend
statusReason: expected [Function] to throw error including 'Invalid email or password' but got 'Something went wrong. Please try agai…'

[Killed] ConditionalExpression
src/api/userApi.ts:116:9
         credentials: "include",
     });
 
-    if (!response.ok) throw new Error("Not authenticated");
+    if (false) throw new Error("Not authenticated");
 
     return response.json();
killedBy: getCurrentUser throws 'Not authenticated' when response is not ok
statusReason: promise resolved "{ error: 'Unauthorized' }" instead of rejecting

[Killed] BooleanLiteral
src/api/userApi.ts:116:9
         credentials: "include",
     });
 
-    if (!response.ok) throw new Error("Not authenticated");
+    if (response.ok) throw new Error("Not authenticated");
 
     return response.json();
killedBy: getCurrentUser returns user object when response is ok
statusReason: Not authenticated

[Killed] BlockStatement
src/api/userApi.ts:123:36
 
 // Logout the user by relying on sessions in the cookie.
 // Failure means session expired so ignore errors and clear local auth state where called.
-export async function logoutUser() {
-    try {
-        await fetch("/api/v1/user/logout", {
-            method: "POST",
-            credentials: "include",
-        });
-    } catch (err) {
-        // ignore errors intentionally
-        console.warn("Logout request failed, clearing client state anyway.", err);
-    }
-}
+export async function logoutUser() {}
 
 // Update user fields. Accepts any combination of username and profilePic.
killedBy: logoutUser calls logout endpoint with correct options
statusReason: expected "fetch" to be called with arguments: [ '/api/v1/user/logout', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/api/userApi.ts:124:9
 // Logout the user by relying on sessions in the cookie.
 // Failure means session expired so ignore errors and clear local auth state where called.
 export async function logoutUser() {
-    try {
-        await fetch("/api/v1/user/logout", {
-            method: "POST",
-            credentials: "include",
-        });
-    } catch (err) {
+    try {} catch (err) {
         // ignore errors intentionally
         console.warn("Logout request failed, clearing client state anyway.", err);
killedBy: logoutUser calls logout endpoint with correct options
statusReason: expected "fetch" to be called with arguments: [ '/api/v1/user/logout', …(1) ]

Number of calls: 0

[Killed] ObjectLiteral
src/api/userApi.ts:125:44
 // Failure means session expired so ignore errors and clear local auth state where called.
 export async function logoutUser() {
     try {
-        await fetch("/api/v1/user/logout", {
-            method: "POST",
-            credentials: "include",
-        });
+        await fetch("/api/v1/user/logout", {});
     } catch (err) {
         // ignore errors intentionally
killedBy: logoutUser calls logout endpoint with correct options
statusReason: expected "fetch" to be called with arguments: [ '/api/v1/user/logout', …(1) ]

Received: 

  1st fetch call:

  [
    "/api/v1/user/logout",

[Killed] StringLiteral
src/api/userApi.ts:125:21
 // Failure means session expired so ignore errors and clear local auth state where called.
 export async function logoutUser() {
     try {
-        await fetch("/api/v1/user/logout", {
+        await fetch("", {
             method: "POST",
             credentials: "include",
killedBy: logoutUser calls logout endpoint with correct options
statusReason: expected "fetch" to be called with arguments: [ '/api/v1/user/logout', …(1) ]

Received: 

  1st fetch call:

  [
-   "/api/v1/user/logout",

[Survived] BlockStatement
src/api/userApi.ts:129:19
             method: "POST",
             credentials: "include",
         });
-    } catch (err) {
-        // ignore errors intentionally
-        console.warn("Logout request failed, clearing client state anyway.", err);
-    }
+    } catch (err) {}
 }
 

[Killed] BlockStatement
src/api/userApi.ts:139:4
 export async function updateUser(id: string, data: {
     username?: string;
     profilePic?: string;
-}) {
-    const response = await fetch(`/api/v1/user/update/${id}`, {
-        method: "PUT",
-        credentials: "include",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify(data),
-    });
-
-    const body = await response.json();
-
-    if (!response.ok) {
-        switch (response.status) {
-            case 401:
-                throw new Error("You must be signed-in to make changes to your account");
-            case 403:
-                throw new Error("A user may only make changes to their account");
-            case 404:
-                throw new Error(body.error);
-            default:
-                throw new Error("Something went wrong. Please try again.");
-        }
-    }
-
-    return body;
-}
+}) {}
 
 // Request an email change, sends a verification code to the new email.
killedBy: updateUser returns body when response is ok
statusReason: expected undefined to deeply equal { id: '123', profilePic: 'avatar3' }

[Killed] ConditionalExpression
src/api/userApi.ts:151:13
 
     if (!response.ok) {
         switch (response.status) {
-            case 401:
-                throw new Error("You must be signed-in to make changes to your account");
+            case 401:
             case 403:
                 throw new Error("A user may only make changes to their account");
killedBy: updateUser throws 401 error message
statusReason: expected [Function] to throw error including 'You must be signed-in to make changes…' but got 'A user may only make changes to their…'

[Survived] ConditionalExpression
src/api/userApi.ts:153:13
         switch (response.status) {
             case 401:
                 throw new Error("You must be signed-in to make changes to your account");
-            case 403:
-                throw new Error("A user may only make changes to their account");
+            case 403:
             case 404:
                 throw new Error(body.error);

[Killed] ConditionalExpression
src/api/userApi.ts:155:13
                 throw new Error("You must be signed-in to make changes to your account");
             case 403:
                 throw new Error("A user may only make changes to their account");
-            case 404:
-                throw new Error(body.error);
+            case 404:
             default:
                 throw new Error("Something went wrong. Please try again.");
killedBy: updateUser throws 404 error message from backend
statusReason: expected [Function] to throw error including 'User not found' but got 'Something went wrong. Please try agai…'

[Killed] BlockStatement
src/api/userApi.ts:166:62
 }
 
 // Request an email change, sends a verification code to the new email.
-export async function changeEmail(id: string, email: string) {
-    const response = await fetch(`/api/v1/user/changeEmail/${id}`, {
-        method: "PUT",
-        credentials: "include",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({ email }),
-    });
-
-    const body = await response.json();
-
-    if (!response.ok) {
-        switch (response.status) {
-            case 401:
-                throw new Error("You must be signed-in to make changes to your account");
-            case 403:
-            case 409:
-            case 422:
-                throw new Error(body.error);
-            default:
-                throw new Error("Something went wrong. Please try again.");
-        }
-    }
-
-    return body;
-}
+export async function changeEmail(id: string, email: string) {}
 
 // confirm the email change
killedBy: changeEmail returns success message when response is ok
statusReason: expected undefined to deeply equal { Object (message) }

[Survived] StringLiteral
src/api/userApi.ts:167:34
 
 // Request an email change, sends a verification code to the new email.
 export async function changeEmail(id: string, email: string) {
-    const response = await fetch(`/api/v1/user/changeEmail/${id}`, {
+    const response = await fetch(``, {
         method: "PUT",
         credentials: "include",

[Survived] StringLiteral
src/api/userApi.ts:168:17
 // Request an email change, sends a verification code to the new email.
 export async function changeEmail(id: string, email: string) {
     const response = await fetch(`/api/v1/user/changeEmail/${id}`, {
-        method: "PUT",
+        method: "",
         credentials: "include",
         headers: { "Content-Type": "application/json" },

[Killed] BlockStatement
src/api/userApi.ts:193:80
 }
 
 // confirm the email change
-export async function confirmEmailChange(id: string, verificationCode: string) {
-    const response = await fetch(`/api/v1/user/confirmEmailChange/${id}`, {
-        method: "PUT",
-        credentials: "include",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({ verificationCode }),
-    });
-
-    const body = await response.json();
-
-    if (!response.ok) {
-        switch (response.status) {
-            case 401:
-                throw new Error("You must be signed-in to make changes to your account");
-            case 400:
-            case 403:
-            case 404:
-                throw new Error(body.error);
-            default:
-                throw new Error("Something went wrong. Please try again.");
-        }
-    }
-}
+export async function confirmEmailChange(id: string, verificationCode: string) {}
 
 // Search for a user by the id. Return their full details.
killedBy: confirmEmailChange throws 401 error message
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/api/userApi.ts:195:17
 // confirm the email change
 export async function confirmEmailChange(id: string, verificationCode: string) {
     const response = await fetch(`/api/v1/user/confirmEmailChange/${id}`, {
-        method: "PUT",
+        method: "",
         credentials: "include",
         headers: { "Content-Type": "application/json" },

[Killed] ConditionalExpression
src/api/userApi.ts:209:13
                 throw new Error("You must be signed-in to make changes to your account");
             case 400:
             case 403:
-            case 404:
-                throw new Error(body.error);
+            case 404:
             default:
                 throw new Error("Something went wrong. Please try again.");
killedBy: confirmEmailChange throws 400 error message from backend
statusReason: expected [Function] to throw error including 'Invalid verification code' but got 'Something went wrong. Please try agai…'

[Killed] BlockStatement
src/api/userApi.ts:225:23
 
     const body = await response.json();
 
-    if (!response.ok) {
-        switch(response.status) {
-            case 404:
-                throw new Error(body.error);
-            default:
-                throw new Error("Something went wrong. Please try again.");
-        } 
-    }
+    if (!response.ok) {}
 
     return {
killedBy: getUserById throws 404 error message from backend
statusReason: expected [Function] to throw error including 'User not found' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/api/userApi.ts:227:13
 
     if (!response.ok) {
         switch(response.status) {
-            case 404:
-                throw new Error(body.error);
+            case 404:
             default:
                 throw new Error("Something went wrong. Please try again.");
killedBy: getUserById throws 404 error message from backend
statusReason: expected [Function] to throw error including 'User not found' but got 'Something went wrong. Please try agai…'

[Killed] MethodExpression
src/api/userApi.ts:238:15
         id: body._id,
         username: body.user_name,
         email: body.email,
-        role: body.role.charAt(0).toUpperCase() + body.role.slice(1), // student --> Student
+        role: body.role.charAt(0).toLowerCase() + body.role.slice(1), // student --> Student
         profilePic: body.profile_pic,
         contributions: body.contributions,
killedBy: getUserById returns mapped user object when response is ok
statusReason: expected { id: '123', username: 'johnny', …(5) } to deeply equal { id: '123', username: 'johnny', …(3) }

[Killed] MethodExpression
src/api/userApi.ts:238:15
         id: body._id,
         username: body.user_name,
         email: body.email,
-        role: body.role.charAt(0).toUpperCase() + body.role.slice(1), // student --> Student
+        role: body.role.toUpperCase() + body.role.slice(1), // student --> Student
         profilePic: body.profile_pic,
         contributions: body.contributions,
killedBy: getUserById returns mapped user object when response is ok
statusReason: expected { id: '123', username: 'johnny', …(5) } to deeply equal { id: '123', username: 'johnny', …(3) }

[Survived] ObjectLiteral
src/api/userApi.ts:251:70
     confirmPassword: string,
 }) {
     // build the request
-    const response = await fetch(`/api/v1/user/resetPassword/${id}`, {
-        method: "PUT",
-        credentials: "include",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify(data),
-    });
+    const response = await fetch(`/api/v1/user/resetPassword/${id}`, {});
 
     const body = await response.json();

[Survived] StringLiteral
src/api/userApi.ts:252:17
 }) {
     // build the request
     const response = await fetch(`/api/v1/user/resetPassword/${id}`, {
-        method: "PUT",
+        method: "",
         credentials: "include",
         headers: { "Content-Type": "application/json" },

[Killed] BlockStatement
src/api/userApi.ts:261:23
     const body = await response.json();
 
     // robustly throw errors
-    if (!response.ok) {
-        switch (response.status) {
-            case 401:
-                throw new Error("You must be signed-in to make changes to your account");
-            case 403:
-            case 422:
-                throw new Error(body.error);
-            default:
-                throw new Error("Something went wrong. Please try again.");
-        }
-    }    
+    if (!response.ok) {}    
 
     return body;
killedBy: resetPassword throws 401 error message
statusReason: promise resolved "{ error: 'Unauthorized' }" instead of rejecting

[Killed] ConditionalExpression
src/api/userApi.ts:266:13
             case 401:
                 throw new Error("You must be signed-in to make changes to your account");
             case 403:
-            case 422:
-                throw new Error(body.error);
+            case 422:
             default:
                 throw new Error("Something went wrong. Please try again.");
killedBy: resetPassword throws 403 error message from backend
statusReason: expected [Function] to throw error including 'Invalid current password' but got 'Something went wrong. Please try agai…'
