[Killed] BlockStatement
src/utils/validators.ts:32:23
     } = {};
 
     // name to not be empty
-    if (!name.trim()) {
-        errors.name = "Name field was empty";
-    }
+    if (!name.trim()) {}
 
     // email domain may only be @myumanitoba or @umanitoba
killedBy: validateSignup fails when name is empty
statusReason: expected {} to deeply equal { name: 'Name field was empty' }

[Killed] ConditionalExpression
src/utils/validators.ts:32:9
     } = {};
 
     // name to not be empty
-    if (!name.trim()) {
+    if (true) {
         errors.name = "Name field was empty";
     }
killedBy: validateSignup returns empty object when input is fully valid
statusReason: expected { name: 'Name field was empty' } to deeply equal {}

[Killed] LogicalOperator
src/utils/validators.ts:37:9
     }
 
     // email domain may only be @myumanitoba or @umanitoba
-    if (!email.endsWith("@myumanitoba.ca") && !email.endsWith("@umanitoba.ca")) {
+    if (!email.endsWith("@myumanitoba.ca") || !email.endsWith("@umanitoba.ca")) {
         errors.email = "Email domain is not valid";
     }
killedBy: validateSignup returns empty object when input is fully valid
statusReason: expected { email: 'Email domain is not valid' } to deeply equal {}

[Killed] ConditionalExpression
src/utils/validators.ts:37:9
     }
 
     // email domain may only be @myumanitoba or @umanitoba
-    if (!email.endsWith("@myumanitoba.ca") && !email.endsWith("@umanitoba.ca")) {
+    if (true) {
         errors.email = "Email domain is not valid";
     }
killedBy: validateSignup returns empty object when input is fully valid
statusReason: expected { email: 'Email domain is not valid' } to deeply equal {}

[Killed] ConditionalExpression
src/utils/validators.ts:42:9
     }
 
     // password must be at least 8 chars long
-    if (password.length < 8) {
+    if (true) {
         errors.password = "Password too short";
     }
killedBy: validateSignup returns empty object when input is fully valid
statusReason: expected { password: 'Password too short' } to deeply equal {}

[Killed] ConditionalExpression
src/utils/validators.ts:42:9
     }
 
     // password must be at least 8 chars long
-    if (password.length < 8) {
+    if (false) {
         errors.password = "Password too short";
     }
killedBy: validateSignup fails when password is shorter than 8 characters
statusReason: expected {} to deeply equal { password: 'Password too short' }

[Killed] ConditionalExpression
src/utils/validators.ts:47:9
     }
 
     // password must match confirmPassword
-    if (confirmPassword !== password) {
+    if (false) {
         errors.confirmPassword = "Passwords do not match";
     }
killedBy: validateSignup fails when passwords do not match
statusReason: expected {} to deeply equal { Object (confirmPassword) }

[Killed] ConditionalExpression
src/utils/validators.ts:47:9
     }
 
     // password must match confirmPassword
-    if (confirmPassword !== password) {
+    if (true) {
         errors.confirmPassword = "Passwords do not match";
     }
killedBy: validateSignup returns empty object when input is fully valid
statusReason: expected { Object (confirmPassword) } to deeply equal {}

[Killed] BooleanLiteral
src/utils/validators.ts:64:9
     } = {};
 
     // fields cannot be empty
-    if (!email.trim()) errors.email = "Email required";
+    if (email.trim()) errors.email = "Email required";
     if (!password.trim()) errors.password = "Password required";
     
killedBy: validateSignin returns empty object when input is fully valid
statusReason: expected { email: 'Email required' } to deeply equal {}

[Killed] ConditionalExpression
src/utils/validators.ts:64:9
     } = {};
 
     // fields cannot be empty
-    if (!email.trim()) errors.email = "Email required";
+    if (false) errors.email = "Email required";
     if (!password.trim()) errors.password = "Password required";
     
killedBy: validateSignin fails when email is empty
statusReason: expected {} to deeply equal { email: 'Email required' }

[Killed] BooleanLiteral
src/utils/validators.ts:65:9
 
     // fields cannot be empty
     if (!email.trim()) errors.email = "Email required";
-    if (!password.trim()) errors.password = "Password required";
+    if (password.trim()) errors.password = "Password required";
     
     // return empty object if valid
killedBy: validateSignin returns empty object when input is fully valid
statusReason: expected { password: 'Password required' } to deeply equal {}

[Killed] ConditionalExpression
src/utils/validators.ts:65:9
 
     // fields cannot be empty
     if (!email.trim()) errors.email = "Email required";
-    if (!password.trim()) errors.password = "Password required";
+    if (false) errors.password = "Password required";
     
     // return empty object if valid
killedBy: validateSignin fails when password is empty
statusReason: expected {} to deeply equal { password: 'Password required' }
