[Killed] LogicalOperator
src/utils/homeHelpers.ts:2:13
 export function slugifyCourseCode(code: string) {
-    return (code ?? "")
+    return (code && "")
         .toLowerCase()
         .trim()
killedBy: slugifyCourseCode lowercases the course code
statusReason: expected '' to be 'comp-1010' // Object.is equality

[Killed] MethodExpression
src/utils/homeHelpers.ts:2:12
 export function slugifyCourseCode(code: string) {
-    return (code ?? "")
-        .toLowerCase()
+    return (code ?? "").toUpperCase()
         .trim()
         .replace(/\s+/g, " ")
killedBy: slugifyCourseCode lowercases the course code
statusReason: expected 'COMP-1010' to be 'comp-1010' // Object.is equality

[Killed] StringLiteral
src/utils/homeHelpers.ts:5:26
     return (code ?? "")
         .toLowerCase()
         .trim()
-        .replace(/\s+/g, " ")
+        .replace(/\s+/g, "")
         .replace(/[^\w\s-]/g, "")
         .replace(/\s/g, "-");
killedBy: slugifyCourseCode lowercases the course code
statusReason: expected 'comp1010' to be 'comp-1010' // Object.is equality

[Killed] Regex
src/utils/homeHelpers.ts:6:18
         .toLowerCase()
         .trim()
         .replace(/\s+/g, " ")
-        .replace(/[^\w\s-]/g, "")
+        .replace(/[^\W\s-]/g, "")
         .replace(/\s/g, "-");
 }
killedBy: slugifyCourseCode lowercases the course code
statusReason: expected '-' to be 'comp-1010' // Object.is equality

[Killed] BlockStatement
src/utils/homeHelpers.ts:12:36
 
 
 export function normalizeAttributes(attributes: unknown): string[] {
-    if (Array.isArray(attributes)) {
-        return attributes.map(String).map((s) => s.trim()).filter(Boolean);
-    }
+    if (Array.isArray(attributes)) {}
     if (typeof attributes === "string") {
         return attributes
killedBy: normalizeAttributes returns array input as trimmed strings
statusReason: expected [] to deeply equal [ 'Lab', 'Lecture' ]

[Killed] MethodExpression
src/utils/homeHelpers.ts:13:50
 
 export function normalizeAttributes(attributes: unknown): string[] {
     if (Array.isArray(attributes)) {
-        return attributes.map(String).map((s) => s.trim()).filter(Boolean);
+        return attributes.map(String).map((s) => s).filter(Boolean);
     }
     if (typeof attributes === "string") {
killedBy: normalizeAttributes returns array input as trimmed strings
statusReason: expected [ 'Lab', ' Lecture ' ] to deeply equal [ 'Lab', 'Lecture' ]

[Killed] MethodExpression
src/utils/homeHelpers.ts:13:16
 
 export function normalizeAttributes(attributes: unknown): string[] {
     if (Array.isArray(attributes)) {
-        return attributes.map(String).map((s) => s.trim()).filter(Boolean);
+        return attributes.map(String).map(s => s.trim());
     }
     if (typeof attributes === "string") {
killedBy: normalizeAttributes filters out empty strings from array input
statusReason: expected [ 'Lab', '', '' ] to deeply equal [ 'Lab' ]

[Killed] BlockStatement
src/utils/homeHelpers.ts:15:41
     if (Array.isArray(attributes)) {
         return attributes.map(String).map((s) => s.trim()).filter(Boolean);
     }
-    if (typeof attributes === "string") {
-        return attributes
-        .split(/[,;|]/g)
-        .map((s) => s.trim())
-        .filter(Boolean);
-    }
+    if (typeof attributes === "string") {}
     return [];
 }
killedBy: normalizeAttributes splits a comma-separated string
statusReason: expected [] to deeply equal [ 'Lab', 'Lecture', 'Tutorial' ]

[Killed] MethodExpression
src/utils/homeHelpers.ts:16:16
         return attributes.map(String).map((s) => s.trim()).filter(Boolean);
     }
     if (typeof attributes === "string") {
-        return attributes
-        .split(/[,;|]/g)
-        .map((s) => s.trim())
-        .filter(Boolean);
+        return attributes.split(/[,;|]/g).map(s => s.trim());
     }
     return [];
killedBy: normalizeAttributes filters out empty segments from string input
statusReason: expected [ 'Lab', '', 'Lecture' ] to deeply equal [ 'Lab', 'Lecture' ]

[Timeout] MethodExpression
src/utils/homeHelpers.ts:18:21
     if (typeof attributes === "string") {
         return attributes
         .split(/[,;|]/g)
-        .map((s) => s.trim())
+        .map((s) => s)
         .filter(Boolean);
     }

[Killed] ArrayDeclaration
src/utils/homeHelpers.ts:21:12
         .map((s) => s.trim())
         .filter(Boolean);
     }
-    return [];
+    return ["Stryker was here"];
 }
 
killedBy: normalizeAttributes returns empty array for null input
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] MethodExpression
src/utils/homeHelpers.ts:26:18
 
 // Lab boolean is not in database.
 export function inferHasLab(attrs: string[], raw: string) {
-    const text = `${attrs.join(" ")} ${raw ?? ""}`.toLowerCase();
+    const text = `${attrs.join(" ")} ${raw ?? ""}`.toUpperCase();
     return /\blab\b|\blaboratory\b/.test(text);
 }
killedBy: inferHasLab returns true when attrs contains 'Lab'
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/utils/homeHelpers.ts:26:40
 
 // Lab boolean is not in database.
 export function inferHasLab(attrs: string[], raw: string) {
-    const text = `${attrs.join(" ")} ${raw ?? ""}`.toLowerCase();
+    const text = `${attrs.join(" ")} ${raw && ""}`.toLowerCase();
     return /\blab\b|\blaboratory\b/.test(text);
 }
killedBy: inferHasLab returns true when raw string contains 'lab'
statusReason: expected false to be true // Object.is equality
